Repository: b-dev/django-newsletter-form
Catalog: newsletter_form/locale/*/LC_MESSAGES/django.po
Languages: it

source: First time this email was confirmed
it: Prima volta in cui questa mail e' stata confermata

source: Send...
it: Invio..

source: SUBSCRIBE
it: Iscriviti

source: Subscription failed
it: Iscrizione fallita

source: Error during the subscription process. Administrator are already informed
it: Errore durante l'iscrizione alla newsletter. L'amministratore è già stato avvisato

source: Subscription confirmed
it: Iscrizione avvenuta con successo

source: Great! From now you'll receive our newsletter!
it: D'ora in poi riceverai la nostra newsletter

source: Subscription to our newsletter confirmed!
it: Iscrizione avvenuta con successo

source: Insert a valid email address
it: Inserisci un indirizzo email valido

source: You're already subscribed to our newsletter
it: Sei già iscritto alla nostra newsletter

source: Welcome! From now you'll receive our newsletter. <br> <br> Thanks, <br> <span style='color:black;text-align: center'>The team</span>
it: Benvenuto! D'ora in poi riceverai la nostra newsletter. <br> <br> Grazie, <br> <span style='color:black;text-align: center'>Il team</span>

source: Insert your email
it: Inserisci la tua email

source: First name
it: Nome

source: Insert your first name
it: Inserisci il tuo nome

source: Last name
it: Cognome

source: Insert your last name
it: Inserisci il tuo cognome

source: SUBSCRIBE NOW
it: ISCRIVITI ORA
